trading_app_api/app/controllers/traders_controller.rb

  def index
    @traders = Trader.all
---
SELECT "traders".* FROM "traders"